snlkuharlocal/src/Documents/ВГХ/ВГХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВГХ</name>
  <registerRecords>InformationRegister.ВГХ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтукВКоробке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукВКоробочке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаркетПлейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ВидВГХ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеВГХ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ВГХ/ВГХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВГХ</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеВГХ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркетПлейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидВГХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ВГХ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВГХ.Номенклатура КАК Номенклатура,
	|	ВГХ.Регистратор.Дата КАК РегистраторДата,
	|	ВГХ.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.ВГХ КАК ВГХ
	|ГДЕ
	|	ВГХ.Номенклатура = &Номенклатура
	|	И ВГХ.Регистратор <> &Ссылка";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НужноПровести=Истина;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 	
		Если ВыборкаДетальныеЗаписи.РегистраторДата>Дата ТОгда
			НужноПровести=Ложь; 
		Иначе 
			
			//Отменим проведение если уже есть такой документ
			Регистратор = ВыборкаДетальныеЗаписи.Регистратор;
			ОбРег= Регистратор.ПолучитьОбъект();
			ОбРег.Записать(РежимЗаписиДокумента.ОтменаПроведения);			
			
			НужноПровести=Истина;
		КонецЕсли;  		
	КонецЕсли;    
	
	Если НужноПровести Тогда
		
		Движения.ВГХ.Записывать = Истина;
		Движения.ВГХ.Очистить();
		
		Для каждого ТекСтрока Из Данные Цикл
			
			Если ТекСтрока.ЗначениеВГХ>0 Тогда
				Движение = Движения.ВГХ.Добавить();
				Движение.Регистратор      = Ссылка;  
				Движение.Автор            = Автор; 
				Движение.НачалоРабот      = НачалоРабот;
				Движение.ОкончаниеРабот   = ОкончаниеРабот;
				Движение.Номенклатура     = Номенклатура;
				Движение.ВидВГХ           = ТекСтрока.ВидВГХ;
				Движение.ЗначениеВГХ      = ТекСтрока.ЗначениеВГХ;   					  
			КонецЕсли;
			
		КонецЦикла;
		
	КОнецЕсли;

	
КонецПроцедуры
